{
    "translation": {
      "navigation": {
        "home": "Accueil",
        "about": "À propos",
        "projects": "Projets",
        "contact": "Contact"
      },
      "home": {
        "paragraphs": {
          "header": "GINO VARELA",
          "header2": "Développeur Web FullStack 🤖",
          "paragraph1": "👋 Bienvenue sur mon portfolio, votre guide convivial à travers le terrain technologique en constante évolution. Contrairement aux plates-formes technologiques traditionnelles, c'est un espace personnel où j'adresse la main aux amateurs de technologie comme vous. Je comprends les défis de rester à jour dans ce domaine dynamique, et mon engagement est simple : vous assister dans vos poursuites.",
          "paragraph2": "Cette plateforme fonctionne à la fois comme une vitrine de mes réalisations et un outil précieux pour la communauté poursuivant ses propres projets technologiques. C'est plus que mon enthousiasme pour la technologie, il s'agit de cultiver votre succès dans le domaine technologique. Rejoignez-moi pour accéder à des idées précieuses et une assistance constante, vous équipant pour surmonter les défis et atteindre vos objectifs dans ce domaine en constante évolution.",
          "paragraph3": "Mon portfolio va au-delà de simplement présenter mes réalisations ; il sert de témoignage du potentiel inexploité en vous."
        },
        "about": {
            "title": "À propos de moi",
          "paragraph1": "👨‍💻 Diplômé en développement web, spécialisé dans le développement web, passionné par les technologies émergentes et les meilleures pratiques. Expérimenté dans le développement de projets en équipe et individuels. Je réalise également des travaux freelance adaptés aux besoins du client. Mon objectif principal est de continuer à croître professionnellement dans le domaine de la technologie et de rester à jour avec les dernières technologies d'aujourd'hui.",
          "paragraph2": "En tant que développeur web enthousiaste, mon aventure technologique ne connaît pas de limites.",
          "paragraph3": "🛠️ Outils que j'utilise au quotidien : HTML5, CSS3, JavaScript, React, Node.js, et au-delà, ma passion alimente ma volonté de croissance constante. Mon portfolio présente des applications web dynamiques qui sont non seulement conviviales, mais aussi réactives."
        },
        "skills": {
          "paragraph1": "🔥 Je suis déterminé à progresser dans le domaine de l'informatique, visant à élargir mes connaissances, accumuler une expérience précieuse et partager activement mon expertise. Cette ambition souligne mon engagement à rester à l'avant-garde de l'industrie informatique dynamique. Je prospère dans l'apprentissage continu, l'affinement des compétences et la contribution impactante à des projets et des équipes.",
          "paragraph2": "Dans notre ère numérique en constante évolution, les développeurs web sont les architectes du royaume en ligne. À chaque ligne de code, nous élaborons des solutions innovantes, élevons les expériences utilisateur et stimulons la transformation numérique. À mesure que la technologie progresse, notre rôle reste crucial, assurant la fonctionnalité, l'esthétique et l'accessibilité du web pour les utilisateurs du monde entier."
        },
        "projects": {
            "title": "Projets",
          "paragraph1": "Ici, je présenterai mes projets en cours de développement ainsi que mes travaux terminés, offrant un aperçu complet de mes compétences et de mon expertise. Explorez la gamme diversifiée de projets que j'ai entrepris pour constater ma croissance et mes capacités de première main. Que vous soyez intéressé par mes dernières entreprises ou mes réalisations passées, vous trouverez une collection qui reflète mon parcours continu dans le développement logiciel et web.",
          "paragraph2": "🗃️ Mes projets",
          "project1": {
            "title": "Solutions de réparation à domicile",
            "status": "Terminé",
            "technologies": "React, Tailwind, Emailjs, CSR",
            "description": "Ce projet consistait en la création d'un site web convivial pour une entreprise locale spécialisée dans les réparations à domicile."
          },
          "project2": {
            "title": "Snake Jeu",
            "status": "En cours de développement",
            "technologies": "Tailwind CSS, React, autre",
            "description": "Jeu Snake basé sur JavaScript, conçu pour divertir les personnes de tous âges, parfait pour vos moments de loisirs."
          },
          "project3": {
            "title": "Prochainement",
            "status": "Prochainement",
            "technologies": "",
            "description": "Restez à l'écoute pour des projets passionnants, des innovations et plus encore. Je m'engage à continuer de progresser en tant que professionnel."
        }
        
        },
        "contact": {
          "title": "✉️ Contactez-moi",
          "labels": {
            "name": "Nom",
            "email": "E-mail",
            "message": "Message"
          },
          "placeholders": {
            "name": "Votre nom...",
            "email": "Votre e-mail...",
            "message": "Message..."
          },
          "validation": {
            "name": {
              "required": "Veuillez remplir ce champ.",
              "maxLength": "Maximum 10 caractères.",
              "pattern": "Caractère invalide."
            },
            "email": {
              "required": "Veuillez remplir ce champ.",
              "validChars": "Seules les lettres, les chiffres, '@' et '.' sont autorisés.",
              "validEmail": "Veuillez saisir un format d'e-mail valide.",
              "maxLength": "Maximum 30 caractères."
            },
            "message": {
              "required": "Veuillez remplir ce champ.",
              "pattern": "Seules les lettres et les chiffres sont autorisés.",
              "maxLength": "Maximum 300 caractères."
            }
          },
          "button": {
            "send": "Envoyer"
          },
          "successMessage": "Votre message a été soumis avec succès !"
        }
      }
    }
  }
  